//*For loop statements
// *যদি কোন জাভাস্ক্রিপ্ট প্রোগ্রাম এর কোন অংশ ঠিক কত বার প্রোগ্রামে পুনরাবৃত্তি বা execute করবে তা পূর্বেই জানা থাকে, তবে সেক্ষেত্রে জাভাস্ক্রিপ্ট এর for লুপ খুব সুবিধাজনক ফলাফল প্রদান করে।
//  *কোন প্রোগ্রামে এক বা একাধিক স্টেটমেন্ট একটা নির্দিষ্ট সংখ্যক বার পর্যন্ত কাজ করতে জাভাস্ক্রিপ্ট এর for লুপ ব্যবহার করা হয়। অর্থাৎ যে সকল ক্ষেত্রে আমরা পূর্ব বা আগে থেকেই জানি যে জাভাস্ক্রিপ্ট কোড গুলো ঠিক কত বার পুনরাবৃত্তি করবে অর্থাৎ execute বা run করবে, সে সকল ক্ষেত্রে জাভাস্ক্রিপ্ট এর for লুপ ব্যবহার করা হয়।

for(var i = 0; i < 10; i++){
  console.log(i);
}